Тест_ЗУП_31_КОРП/src/Documents/ПоследствияНесчастногоСлучая/ПоследствияНесчастногоСлучая.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоследствияНесчастногоСлучая</name>
  <basedOn>Document.НесчастныйСлучайНаПроизводстве</basedOn>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.НесчастныйСлучайНаПроизводстве</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьИспорченногоОборудования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьРазрушенныхЗданий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрочиеРасходы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РешениеПрокуратуры</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммарныйМатериальныйУщерб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроисшествия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАкта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерАкта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьРуководителя</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаОхрануТруда</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьОтветственногоЗаОхрануТруда</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставПострадавшие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Пострадавшие</name>
    <attributes>
      <name>Пострадавший</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Последствия</name>
      <type>
        <types>CatalogRef.ПоследствияНесчастногоСлучая</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончательныйДиагноз</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РазмерЕжемесячнойВыплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриказОНазначенииЕжемесячныхВыплат</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>БольничныеЛистыПострадавших</name>
    <attributes>
      <name>Пострадавший</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>БольничныйЛист</name>
      <type>
        <types>DocumentRef.БольничныйЛист</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест_ЗУП_31_КОРП/src/Enums/ПричиныНетрудоспособности/ПричиныНетрудоспособности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПричиныНетрудоспособности</name>
  <enumValues>
    <name>ОбщееЗаболевание</name>
  </enumValues>
  <enumValues>
    <name>ПоБеременностиИРодам</name>
  </enumValues>
  <enumValues>
    <name>ТравмаНаПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>Профзаболевание</name>
  </enumValues>
  <enumValues>
    <name>ПоУходуЗаРебенком</name>
  </enumValues>
  <enumValues>
    <name>ПоУходуЗаВзрослым</name>
  </enumValues>
  <enumValues>
    <name>Карантин</name>
  </enumValues>
  <enumValues>
    <name>Протезирование</name>
  </enumValues>
  <enumValues>
    <name>ПособиеПриДолечивании</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Documents/ПоследствияНесчастногоСлучая/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		МетаданныеОбъекта = ЭтотОбъект.Метаданные();
		Для Каждого ПараметрЗаполнения Из ДанныеЗаполнения Цикл
			Если МетаданныеОбъекта.Реквизиты.Найти(ПараметрЗаполнения.Ключ)<>Неопределено Тогда
				ЭтотОбъект[ПараметрЗаполнения.Ключ] = ПараметрЗаполнения.Значение;
			Иначе
				Если ОбщегоНазначения.ЭтоСтандартныйРеквизит(МетаданныеОбъекта.СтандартныеРеквизиты, ПараметрЗаполнения.Ключ) Тогда
					ЭтотОбъект[ПараметрЗаполнения.Ключ] = ПараметрЗаполнения.Значение;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НесчастныйСлучайНаПроизводстве") Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НесчастныйСлучайНаПроизводствеПострадавшие.Ссылка,
		|	НесчастныйСлучайНаПроизводстве.Организация,
		|	НесчастныйСлучайНаПроизводстве.Подразделение,
		|	НесчастныйСлучайНаПроизводствеПострадавшие.Пострадавший
		|ПОМЕСТИТЬ ВТПострадавшие
		|ИЗ
		|	Документ.НесчастныйСлучайНаПроизводстве.Пострадавшие КАК НесчастныйСлучайНаПроизводствеПострадавшие
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НесчастныйСлучайНаПроизводстве КАК НесчастныйСлучайНаПроизводстве
		|		ПО НесчастныйСлучайНаПроизводствеПострадавшие.Ссылка = НесчастныйСлучайНаПроизводстве.Ссылка
		|ГДЕ
		|	НесчастныйСлучайНаПроизводствеПострадавшие.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Пострадавшие.Ссылка,
		|	Пострадавшие.Организация,
		|	Пострадавшие.Подразделение,
		|	Пострадавшие.Пострадавший,
		|	БольничныйЛист.Ссылка КАК БольничныйЛист
		|ИЗ
		|	ВТПострадавшие КАК Пострадавшие
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.БольничныйЛист КАК БольничныйЛист
		|		ПО Пострадавшие.Пострадавший = БольничныйЛист.ФизическоеЛицо
		|			И (БольничныйЛист.ПричинаНетрудоспособности = ЗНАЧЕНИЕ(Перечисление.ПричиныНетрудоспособности.ТравмаНаПроизводстве))";
		
		Пострадавшие.Очистить();
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Организация = Выборка.Организация;
			Подразделение = Выборка.Подразделение;
			ДокументОснование = Выборка.Ссылка;
			
			Если Пострадавшие.Найти(Выборка.Пострадавший, "Пострадавший") = Неопределено Тогда
				НоваяСтрока = Пострадавшие.Добавить();
				НоваяСтрока.Пострадавший = Выборка.Пострадавший;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Выборка.БольничныйЛист) Тогда
				НоваяСтрока = БольничныеЛистыПострадавших.Добавить();
				НоваяСтрока.Пострадавший = Выборка.Пострадавший;
				НоваяСтрока.БольничныйЛист = Выборка.БольничныйЛист;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	МассивПострадавших = Пострадавшие.ВыгрузитьКолонку("Пострадавший");
	ДатаПроисшествия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "ДатаПроисшествия");
	КраткийСоставПострадавшие = ЗарплатаКадры.КраткийСоставФизЛиц(МассивПострадавших, ДатаПроисшествия);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЗарплатаКадры.ПроверитьКорректностьДаты(Ссылка, ДатаАкта, "Объект.ДатаАкта", Отказ, НСтр("ru='Дата акта'"), , , Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает структуру параметров для ограничения регистрации объекта при обмене
// Вызывается ПередЗаписью объекта.
//
// Возвращаемое значение:
//	ОграниченияРегистрации - Структура - Описание см. ОбменДаннымиЗарплатаКадры.ОграниченияРегистрации.
//
Функция ОграниченияРегистрации() Экспорт
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Новый Структура("Пострадавшие", "Пострадавший"));
	
	Возврат ОбменДаннымиЗарплатаКадры.ОграниченияРегистрацииПоОрганизацииИФизическимЛицам(ЭтотОбъект, Организация, МассивПараметров, ДатаПроисшествия);
	
КонецФункции

#КонецОбласти

#КонецЕсли
